<template><div><h1 id="_21-04-15" tabindex="-1"><a class="header-anchor" href="#_21-04-15" aria-hidden="true">#</a> 21.04.15</h1>
<h2 id="pwa" tabindex="-1"><a class="header-anchor" href="#pwa" aria-hidden="true">#</a> PWA</h2>
<ul>
<li>
<p>웹1 - 그냥 보여주기 식</p>
</li>
<li>
<p>웹2 - 사용자와 상호작용</p>
</li>
<li>
<p>웹3<br>
앱 &gt; 웹 &gt; 웹뷰 (하이브리드 웹) :</p>
</li>
<li>
<p>웹뷰 : 모바일 웹의 느린걸 그대로 가게 됨. 너무 느리니까 계속 고민</p>
</li>
<li>
<p>Native 언어 : 네이티브 앱 하나를 만들면 ios android에서 지원해주겠다.</p>
</li>
<li>
<p>모바일 앱 표준화 되었음</p>
</li>
<li>
<p>pwa 가 확장이 되었음<br>
(스타벅스 앱)<br>
sns 같은 서비스 정보 전달의 역할을 하는 것은 앱이 막강한 영향을 끼칠 수 있음<br>
모바일에서 끝나는 것이 아니라 패드가 나오면서 삼중 작업이 필요하게 되었음.<br>
대부분의 큰 회사 어플리케이션 큰 회사는 모바일 개발자 서버 개발자 등등 다 뽑음. 그러나 작은 회사들은 작업이 어려움</p>
</li>
<li>
<p>jQuery
jQuery는 UI가 정말 안 예쁨.<br>
부트스트랩 템플릿이 완성되어 있음</p>
</li>
</ul>
<p>결국 웹임.<br>
MANIFEST.JSON<br>
이거 하나만 가지고 이게 PWA 라는 게 정의가 됨</p>
<p>무조건 HTTPS 만 설치가 됨.</p>
<p>중요한건 아이콘이 있어야 함.<br>
앱이기 때문에 OFFLINE에서 제공해줘야 함.<br>
알람 NOTIFY 기능이 있어야 함.</p>
<p>우리가 알고 있는 환경</p>
<ul>
<li>
<p>WINDOW</p>
</li>
<li>
<p>WEB</p>
</li>
<li>
<p>서비스 워커라는 환경이 있음<br>
서비스 워커를 등록하여 유저 환경에서 돌아가게끔 한다.</p>
</li>
<li>
<p>서비스 워커<br>
서비스 워커 제공 안하는 브라우저가 사파리?<br>
암튼. 그러면 브라우저에서 실행하면 서비스 워커가 등록이 됨.<br>
앱도 설치 됨.<br>
서비스 워커의 핵심.<br>
오프라인에서 어떻게 할 거냐.<br>
(크롬, 네트워크에서 오프라인 설정해서 시험해볼 수 있음)<br>
서비스 워커라는게 캐시를 사용하는 것이다.<br>
오프라인이 되면 캐시에서 가져옴.</p>
</li>
</ul>
<ul>
<li>무조건 있어야 하는 파일과</li>
<li>네트워크가 있을 때 필요한 파일을 나눔.</li>
</ul>
<p>fetch 부분에서 네트워크 통신하는 부분을 구현</p>
<p>반응형으로 만드는 방법<br>
css 네임중에<br>
@media<br>
앱을 설치하고 싶을 때<br>
웹에 올리면 알아서 설치가 가능함.</p>
<p>그리고 개괄적으로는 반응형이 디자이너가 가능하게 된 것이고<br>
개발자는 비지니스로직만 구현하면 되는 것이다.</p>
</div></template>
